Whale63/STM32Project/陈天乐的智能小车/Hardware/Key.c
#include "stm32f10x.h"                  // Device header
#include "Delay.h"
 
void Key_Init(void)
{
 
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);	 
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);						 
}

uint8_t Key_GetNum(void)
{
	uint8_t KeyNum = 0;		 
	
	if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_2) == 0)			 
	{
		Delay_ms(20);										 
		while (GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_2) == 0); 
		Delay_ms(20);											 
		KeyNum = 1;												 
	}
	
	if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3) == 0)		 
	{
		Delay_ms(20);											 
		while (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_3) == 0);	 
		Delay_ms(20);											 
		KeyNum = 2;												 
	}
	
	return KeyNum;			 
}


void TCRT5000_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);		 
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);
	
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3 | GPIO_Pin_4 | GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);	

	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);	
}
